#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ecs.data.aws_iam_policy_document.assume_role_tasks: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_ecs: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_autoscaling: Reading...
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-0e3b2cfb9d24544c1]
module.ecs.data.aws_iam_policy_document.assume_role_autoscaling: Read complete after 0s [id=3716440655]
module.ecs.data.aws_iam_policy_document.assume_role_tasks: Read complete after 0s [id=1077804475]
module.ecs.data.aws_iam_policy_document.assume_role_ecs: Read complete after 0s [id=1077804475]
module.ecs.aws_iam_role.ecs_tasks_role: Refreshing state... [id=ecs-tasks-role]
module.ecs.aws_iam_role.ecs_autoscaling_role: Refreshing state... [id=ecs-autoscaling-role]
module.ecs.aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs-execution-role]
module.ecs.aws_iam_role_policy_attachment.ecs_autoscaling_policy_attachment: Refreshing state... [id=ecs-autoscaling-role-20241106014438419200000001]
module.ecs.aws_iam_role_policy_attachment.task_execution_role_policy_attachment: Refreshing state... [id=ecs-tasks-role-20241106014438434100000002]
module.ecs.aws_iam_role_policy.service_discovery_policy: Refreshing state... [id=ecs-tasks-role:service-discovery-policy]
module.network.aws_subnet.public_subnet_1: Refreshing state... [id=subnet-0305a92716a89021c]
module.network.aws_subnet.private_subnet_1: Refreshing state... [id=subnet-02350539a77ac1450]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-079a5419154c5bd77]
module.network.aws_security_group.db_sg: Refreshing state... [id=sg-03e5d862f330003d6]
module.network.aws_security_group.ecs_tasks_sg: Refreshing state... [id=sg-0b13d05105af77c92]
module.network.aws_subnet.private_subnet_2: Refreshing state... [id=subnet-044ead642cf06c16c]
module.ecs.aws_service_discovery_private_dns_namespace.namespace: Refreshing state... [id=ns-o2kto7ow5yc5iw5c]
module.network.aws_subnet.public_subnet_2: Refreshing state... [id=subnet-05e9053e2e72a6660]
module.network.aws_route_table.private_route_table: Refreshing state... [id=rtb-05644803cd059b83e]
module.network.aws_security_group.lb_sg: Refreshing state... [id=sg-085a5ed2d65864c74]
module.network.aws_route_table.public_route_table: Refreshing state... [id=rtb-03778462738bc5c2c]
module.network.aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4_ecs: Refreshing state... [id=sgr-0208da99c4fc9cc5e]
module.network.aws_vpc_security_group_ingress_rule.allow_http_ecs: Refreshing state... [id=sgr-0353db74b78e4938a]
module.network.aws_vpc_security_group_ingress_rule.allow_mysql_public: Refreshing state... [id=sgr-01d477ee6584632c1]
module.network.aws_vpc_security_group_ingress_rule.allow_mysql: Refreshing state... [id=sgr-0c75b1fc0cee96a19]
module.network.aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4_db: Refreshing state... [id=sgr-043cba1ed911d160d]
module.network.aws_route.internet_access: Refreshing state... [id=r-rtb-03778462738bc5c2c1080289494]
module.network.aws_vpc_security_group_ingress_rule.allow_https: Refreshing state... [id=sgr-0d9c4317469c05a71]
module.network.aws_vpc_security_group_ingress_rule.allow_traffic_from_lb: Refreshing state... [id=sgr-01819edbf1d7c2e3f]
module.network.aws_vpc_security_group_ingress_rule.allow_http: Refreshing state... [id=sgr-04f36b685fe4b21ef]
module.network.aws_vpc_security_group_egress_rule.allow_traffic_ecs: Refreshing state... [id=sgr-06c042697e62e0f44]
module.network.aws_route_table_association.private_subnet_association_2: Refreshing state... [id=rtbassoc-0eb39fb58cc6e48e1]
module.network.aws_route_table_association.public_subnet_1: Refreshing state... [id=rtbassoc-0f80aceb43d6bcf3e]
module.network.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=kickoff-db-subnet-group]
module.network.aws_route_table_association.private_subnet_association_1: Refreshing state... [id=rtbassoc-010cb7a5a0b788e0e]
module.network.aws_db_subnet_group.db_public_subnet_group: Refreshing state... [id=kickoff-db-public-subnet-group]
module.network.aws_route_table_association.public_subnet_2: Refreshing state... [id=rtbassoc-0df7673337878ebc1]
module.ecs.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:loadbalancer/app/kickoff-lb/cb173ef84caa921f]
module.rds.aws_db_instance.db_instance["clubs"]: Refreshing state... [id=db-PS3ADY5ZLLKGWBRSZSFSZIIHRU]
module.rds.aws_db_instance.db_instance["tournaments"]: Refreshing state... [id=db-4DKUW2IYFWPPJLTEXINANTENHE]
module.rds.aws_db_instance.db_instance["users"]: Refreshing state... [id=db-SSQXFE55JV3EBTKSQH426QJYSQ]
module.ecs.aws_alb_listener.alb_http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:listener/app/kickoff-lb/cb173ef84caa921f/7da3ee33e5007535]
module.ecs.aws_alb_listener.alb_https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:listener/app/kickoff-lb/cb173ef84caa921f/baf4e6b34b52c2f4]
module.ecs.aws_cloudwatch_log_group.log_group["clubs"]: Refreshing state... [id=/ecs/clubs]
module.ecs.aws_cloudwatch_log_group.log_group["tournaments"]: Refreshing state... [id=/ecs/tournaments]
module.ecs.aws_service_discovery_service.service["clubs"]: Refreshing state... [id=srv-62b5gvp7pdqwqitj]
module.ecs.aws_cloudwatch_log_group.log_group["chatbot"]: Refreshing state... [id=/ecs/chatbot]
module.ecs.aws_service_discovery_service.service["users"]: Refreshing state... [id=srv-574twl67ooqkv4rw]
module.ecs.aws_service_discovery_service.service["tournaments"]: Refreshing state... [id=srv-d422xlpwstdqgfyp]
module.ecs.aws_cloudwatch_log_group.log_group["users"]: Refreshing state... [id=/ecs/users]
module.ecs.aws_service_discovery_service.service["chatbot"]: Refreshing state... [id=srv-s5hm3wsw2lfqsl4q]
module.ecs.aws_ecs_task_definition.app["clubs"]: Refreshing state... [id=clubs-task]
module.ecs.aws_ecs_task_definition.app["tournaments"]: Refreshing state... [id=tournaments-task]
module.ecs.aws_ecs_task_definition.app["users"]: Refreshing state... [id=users-task]
module.ecs.aws_ecs_task_definition.app["chatbot"]: Refreshing state... [id=chatbot-task]
module.ecs.aws_ecs_cluster.service_cluster["clubs"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:cluster/clubs-cluster]
module.ecs.aws_ecs_cluster.service_cluster["chatbot"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:cluster/chatbot-cluster]
module.ecs.aws_ecs_cluster.service_cluster["tournaments"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:cluster/tournaments-cluster]
module.ecs.aws_ecs_cluster.service_cluster["users"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:cluster/users-cluster]
module.ecs.aws_alb_target_group.app["users"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:targetgroup/users-target-group/7dd7da06fdd13ced]
module.ecs.aws_alb_target_group.app["chatbot"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:targetgroup/chatbot-target-group/e6d8f38ce81903aa]
module.ecs.aws_alb_target_group.app["clubs"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:targetgroup/clubs-target-group/c3e07014e93f6dec]
module.ecs.aws_alb_target_group.app["tournaments"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:targetgroup/tournaments-target-group/1273e8e883eaf718]
module.ecs.aws_cloudwatch_log_stream.log_stream["users"]: Refreshing state... [id=users-log-stream]
module.ecs.aws_cloudwatch_log_stream.log_stream["chatbot"]: Refreshing state... [id=chatbot-log-stream]
module.ecs.aws_cloudwatch_log_stream.log_stream["clubs"]: Refreshing state... [id=clubs-log-stream]
module.ecs.aws_cloudwatch_log_stream.log_stream["tournaments"]: Refreshing state... [id=tournaments-log-stream]
module.ecs.aws_lb_listener_rule.app["clubs"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:listener-rule/app/kickoff-lb/cb173ef84caa921f/baf4e6b34b52c2f4/d8696ceab2eaaf7d]
module.ecs.aws_lb_listener_rule.app["tournaments"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:listener-rule/app/kickoff-lb/cb173ef84caa921f/baf4e6b34b52c2f4/08e483c31e3aa769]
module.ecs.aws_ecs_service.app["users"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:service/users-cluster/users-service]
module.ecs.aws_ecs_service.app["chatbot"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:service/chatbot-cluster/chatbot-service]
module.ecs.aws_lb_listener_rule.app["users"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:listener-rule/app/kickoff-lb/cb173ef84caa921f/baf4e6b34b52c2f4/d7c3c96d016fe3eb]
module.ecs.aws_lb_listener_rule.app["chatbot"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:430118854294:listener-rule/app/kickoff-lb/cb173ef84caa921f/baf4e6b34b52c2f4/557c18311bf03a3a]
module.ecs.aws_ecs_service.app["clubs"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:service/clubs-cluster/clubs-service]
module.ecs.aws_ecs_service.app["tournaments"]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:430118854294:service/tournaments-cluster/tournaments-service]
module.ecs.aws_appautoscaling_target.app["tournaments"]: Refreshing state... [id=service/tournaments-cluster/tournaments-service]
module.ecs.aws_appautoscaling_target.app["chatbot"]: Refreshing state... [id=service/chatbot-cluster/chatbot-service]
module.ecs.aws_appautoscaling_target.app["clubs"]: Refreshing state... [id=service/clubs-cluster/clubs-service]
module.ecs.aws_appautoscaling_target.app["users"]: Refreshing state... [id=service/users-cluster/users-service]
module.ecs.aws_appautoscaling_policy.scale_down["chatbot"]: Refreshing state... [id=chatbot-scale-down]
module.ecs.aws_appautoscaling_policy.scale_up["tournaments"]: Refreshing state... [id=tournaments-scale-up]
module.ecs.aws_appautoscaling_policy.scale_up["users"]: Refreshing state... [id=users-scale-up]
module.ecs.aws_appautoscaling_policy.scale_up["clubs"]: Refreshing state... [id=clubs-scale-up]
module.ecs.aws_appautoscaling_policy.scale_up["chatbot"]: Refreshing state... [id=chatbot-scale-up]
module.ecs.aws_appautoscaling_policy.scale_down["clubs"]: Refreshing state... [id=clubs-scale-down]
module.ecs.aws_appautoscaling_policy.scale_down["users"]: Refreshing state... [id=users-scale-down]
module.ecs.aws_appautoscaling_policy.scale_down["tournaments"]: Refreshing state... [id=tournaments-scale-down]
module.ecs.aws_cloudwatch_metric_alarm.cpu_high["chatbot"]: Refreshing state... [id=chatbot-cpu-high]
module.ecs.aws_cloudwatch_metric_alarm.cpu_low["users"]: Refreshing state... [id=users-cpu-low]
module.ecs.aws_cloudwatch_metric_alarm.cpu_low["tournaments"]: Refreshing state... [id=tournaments-cpu-low]
module.ecs.aws_cloudwatch_metric_alarm.cpu_high["clubs"]: Refreshing state... [id=clubs-cpu-high]
module.ecs.aws_cloudwatch_metric_alarm.cpu_low["clubs"]: Refreshing state... [id=clubs-cpu-low]
module.ecs.aws_cloudwatch_metric_alarm.cpu_high["users"]: Refreshing state... [id=users-cpu-high]
module.ecs.aws_cloudwatch_metric_alarm.cpu_high["tournaments"]: Refreshing state... [id=tournaments-cpu-high]
module.ecs.aws_cloudwatch_metric_alarm.cpu_low["chatbot"]: Refreshing state... [id=chatbot-cpu-low]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.app["chatbot"] will be updated in-place
  ~ resource "aws_appautoscaling_target" "app" {
        id                 = "service/chatbot-cluster/chatbot-service"
      ~ role_arn           = "arn:aws:iam::430118854294:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::430118854294:role/ecs-autoscaling-role"
        tags               = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_appautoscaling_target.app["clubs"] will be updated in-place
  ~ resource "aws_appautoscaling_target" "app" {
        id                 = "service/clubs-cluster/clubs-service"
      ~ role_arn           = "arn:aws:iam::430118854294:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::430118854294:role/ecs-autoscaling-role"
        tags               = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_appautoscaling_target.app["tournaments"] will be updated in-place
  ~ resource "aws_appautoscaling_target" "app" {
        id                 = "service/tournaments-cluster/tournaments-service"
      ~ role_arn           = "arn:aws:iam::430118854294:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::430118854294:role/ecs-autoscaling-role"
        tags               = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_appautoscaling_target.app["users"] will be updated in-place
  ~ resource "aws_appautoscaling_target" "app" {
        id                 = "service/users-cluster/users-service"
      ~ role_arn           = "arn:aws:iam::430118854294:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::430118854294:role/ecs-autoscaling-role"
        tags               = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.app["chatbot"] will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:ap-southeast-1:430118854294:service/chatbot-cluster/chatbot-service"
        name                               = "chatbot-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/chatbot-task:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app["clubs"] will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:ap-southeast-1:430118854294:service/clubs-cluster/clubs-service"
        name                               = "clubs-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/clubs-task:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app["tournaments"] will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:ap-southeast-1:430118854294:service/tournaments-cluster/tournaments-service"
        name                               = "tournaments-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/tournaments-task:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app["users"] will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:ap-southeast-1:430118854294:service/users-cluster/users-service"
        name                               = "users-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/users-task:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app["chatbot"] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/chatbot-task:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/chatbot-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "chatbot-task" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.app["clubs"] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/clubs-task:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/clubs-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "clubs-task" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.app["tournaments"] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/tournaments-task:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/tournaments-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "tournaments-task" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.app["users"] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/users-task:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-southeast-1:430118854294:task-definition/users-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "users-task" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 8 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @vincetyy, Action: `pull_request`*